netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_deleteList_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:messages_2014_1.platform.webservices.netsuite.com"
                  xmlns:urn1="urn:core_2014_1.platform.webservices.netsuite.com"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <urn:passport>
            <urn1:email>%s(email)</urn1:email>
            <urn1:password>%s(password)</urn1:password>
            <urn1:account>%s(account)</urn1:account>
        </urn:passport>
    </soapenv:Header>
    <soapenv:Body>
        <urn:deleteList>
            <RecordRef internalId="%s(addListMandatoryInternalId)" type="customer" xsi:type="platformCore:RecordRef"
                       xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com"/>
        </urn:deleteList>
    </soapenv:Body>
</soapenv:Envelope>